# ----------------------------
# Taps
# ----------------------------
tap "homebrew/services"
tap "mongodb/brew"
tap "supabase/tap"
tap "hudochenkov/sshpass"
tap "mczachurski/wallpapper"

# ----------------------------
# Core CLI + shell
# ----------------------------
brew "git"
brew "git-delta"
brew "gh"
brew "stow"
brew "starship"
brew "direnv"
brew "just"
brew "atuin"
brew "zoxide"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"
brew "wget"
brew "tmux"
brew "zellij"
brew "bat"
brew "eza"
brew "dust"
brew "bottom"
brew "tealdeer"
brew "glow"
brew "tree"
brew "thefuck"
brew "lazygit"
brew "neofetch"
brew "pstree"
brew "bfg"

# ----------------------------
# Editors / formatters / dev UX
# ----------------------------
brew "neovim"
brew "prettierd"
brew "swiftformat"
brew "luarocks"
brew "pipx"
brew "cocoapods"

# ----------------------------
# Build tools / compilers / libs
# ----------------------------
brew "cmake"
brew "ccache"
brew "coreutils"
brew "swig"
brew "pkg-config"
brew "libffi"
brew "i686-elf-gcc"
brew "openblas"
brew "metis"
brew "tree-sitter"

# ----------------------------
# Languages & version managers
# ----------------------------
brew "node"
brew "pnpm"
brew "pyenv"
brew "rbenv"
brew "rustup-init"
brew "go"
brew "openjdk@17"
brew "nvm"

# ----------------------------
# Media / imaging
# ----------------------------
brew "ffmpeg"
brew "imagemagick"
brew "poppler"
brew "tesseract"
brew "jpeg-xl"
brew "aom"
brew "harfbuzz"
brew "chafa"
brew "catimg"
brew "chafa"
brew "switchaudio-osx"

# ----------------------------
# Databases & services
# ----------------------------
brew "postgresql@14", restart_service: :changed
brew "mongosh"
brew "mongodb-atlas-cli"
brew "mongodb/brew/mongodb-community"
brew "supabase/tap/supabase"

# ----------------------------
# Virtualization / misc tooling
# ----------------------------
brew "qemu"
brew "mtr"
brew "ncdu"
brew "wimlib"
brew "winetricks"

# ----------------------------
# Casks (GUI apps)
# ----------------------------
cask "ghostty"
cask "wine-stable"
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "sf-symbols"
cask "exifcleaner"
cask "gstreamer-runtime"

# ----------------------------
# VS Code extensions (optional)
# ----------------------------
vscode "1yib.rust-bundle"
vscode "akamud.vscode-theme-onelight"
vscode "alexowl.transparent-color-theme"
vscode "bradlc.vscode-tailwindcss"
vscode "brandonkirbyson.vscode-animations"
vscode "dbaeumer.vscode-eslint"
vscode "dgileadi.java-decompiler"
vscode "docker.docker"
vscode "drcika.apc-extension"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gitpod.gitpod-desktop"
vscode "james-yu.latex-workshop"
vscode "leanprover.lean4"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mwpb.java-prettier-formatter"
vscode "nucllear.vscode-extension-auto-import"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "sadra1f.minimal-dark-s1f"
vscode "steoates.autoimport"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "xabikos.javascriptsnippets"


# ----------------------------
# Cargo-installed bins (optional)
# ----------------------------
cargo "termstartup"
